src/CFD/heatedplate6.3/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    upperWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2700;
        startFace       77100;
    }
    lowerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2600;
        startFace       79800;
    }
    heatedWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       82400;
    }
    inlet
    {
        type            patch;
        nFaces          300;
        startFace       82500;
    }
    outlet
    {
        type            patch;
        nFaces          300;
        startFace       82800;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          1800;
        startFace       83100;
    }
)

// ************************************************************************* //
